In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ["Abhinav", "Rahul", "Shivansh", "Display"],
    "marks" : [93, 4, 66, 33],
    "city" : ["Mumbai", "kalyan", "Madhubani", "Kolkata"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

       name  marks       city
0   Abhinav     93     Mumbai
1     Rahul      4     kalyan
2  Shivansh     66  Madhubani
3   Display     33    Kolkata

In [5]:
df.to_csv("friends.csv")

In [6]:
df.to_csv("friends_indexFalse.csv", index=False)

In [7]:
df.head(2)

      name  marks    city
0  Abhinav     93  Mumbai
1    Rahul      4  kalyan

In [8]:
df.tail(2)

       name  marks       city
2  Shivansh     66  Madhubani
3   Display     33    Kolkata

In [9]:
df.tail(10)

       name  marks       city
0   Abhinav     93     Mumbai
1     Rahul      4     kalyan
2  Shivansh     66  Madhubani
3   Display     33    Kolkata

In [10]:
df.describe()

           marks
count   4.000000
mean   49.000000
std    38.755645
min     4.000000
25%    25.750000
50%    49.500000
75%    72.750000
max    93.000000

In [11]:
train = pd.read_csv("train.csv")

In [12]:
train["Speed"]

0    129
1    123
2    200
3     90
Name: Speed, dtype: int64

In [13]:
train["city"][0]

'Mumbai'

In [14]:
train['city'][3] = "Patna"

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_8252/3634185913.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['city'][3] = "Patna"

In [15]:
train.to_csv("train.csv", index=False)

In [16]:
train

   Tain no.  Speed    city
0    893009    129  Mumbai
1    239843    123   Delhi
2    234323    200    Kota
3    324234     90   Patna

In [17]:
train.index = ["First", "Second", "Third", "Fourth"]

In [18]:
train

        Tain no.  Speed    city
First     893009    129  Mumbai
Second    239843    123   Delhi
Third     234323    200    Kota
Fourth    324234     90   Patna

In [19]:
series = pd.Series(np.random.rand(20))

In [20]:
print(series, type(series))

0     0.622280
1     0.664194
2     0.361714
3     0.719448
4     0.643432
5     0.084894
6     0.430714
7     0.685801
8     0.551663
9     0.213536
10    0.851859
11    0.813171
12    0.967095
13    0.631282
14    0.616555
15    0.617576
16    0.645973
17    0.945172
18    0.849356
19    0.890544
dtype: float64 <class 'pandas.core.series.Series'>

In [21]:
new_df = pd.DataFrame(np.random.rand(445, 6), index=np.arange(445))

In [22]:
new_df.head()

          0         1         2         3         4         5
0  0.921391  0.050022  0.837252  0.374849  0.972840  0.120565
1  0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
2  0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
3  0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
4  0.990029  0.922096  0.144762  0.805237  0.841767  0.618002

In [23]:
new_df.tail()

            0         1         2         3         4         5
440  0.884037  0.597886  0.544405  0.762133  0.125261  0.371775
441  0.939527  0.011641  0.039981  0.146822  0.535565  0.770666
442  0.851114  0.993301  0.061036  0.508179  0.278689  0.207377
443  0.817977  0.630820  0.980287  0.616830  0.207621  0.757789
444  0.429324  0.755577  0.574693  0.744366  0.572660  0.266814

In [24]:
new_df.describe()

                0           1           2           3           4           5
count  445.000000  445.000000  445.000000  445.000000  445.000000  445.000000
mean     0.502499    0.493714    0.499430    0.501626    0.486747    0.523581
std      0.283302    0.290830    0.290262    0.291950    0.273689    0.280872
min      0.002606    0.001512    0.008975    0.001293    0.004836    0.009496
25%      0.260367    0.227204    0.257810    0.246150    0.260478    0.296936
50%      0.530585    0.509196    0.482813    0.493998    0.462239    0.532083
75%      0.742277    0.742295    0.744897    0.759659    0.723544    0.757789
max      0.993430    0.998895    0.997731    0.997309    0.998477    0.991630

In [25]:
print(type(new_df))

<class 'pandas.core.frame.DataFrame'>

In [26]:
new_df[0][0] = "Abhinav"

In [27]:
new_df.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
5    float64
dtype: object

In [28]:
new_df.head()

          0         1         2         3         4         5
0   Abhinav  0.050022  0.837252  0.374849  0.972840  0.120565
1  0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
2  0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
3  0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
4  0.990029  0.922096  0.144762  0.805237  0.841767  0.618002

In [29]:
new_df[0][0] = 0.5

In [30]:
new_df.head()

          0         1         2         3         4         5
0       0.5  0.050022  0.837252  0.374849  0.972840  0.120565
1  0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
2  0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
3  0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
4  0.990029  0.922096  0.144762  0.805237  0.841767  0.618002

In [31]:
new_df.T

,0,1,2,3,4,5,6,7,8,9,...,435,436,437,438,439,440,441,442,443,444
0,0.5,0.500473,0.680977,0.748453,0.990029,0.941996,0.144695,0.036678,0.600133,0.277083,...,0.10592,0.2626,0.705288,0.428054,0.6021,0.884037,0.939527,0.851114,0.817977,0.429324
1,0.050022,0.685561,0.69938,0.791702,0.922096,0.576274,0.118365,0.167078,0.679327,0.05703,...,0.386884,0.233281,0.380009,0.216383,0.242117,0.597886,0.011641,0.993301,0.63082,0.755577
2,0.837252,0.154368,0.821352,0.748612,0.144762,0.646738,0.342959,0.116106,0.457975,0.829709,...,0.261383,0.394789,0.60214,0.802912,0.910003,0.544405,0.039981,0.061036,0.980287,0.574693
3,0.374849,0.516212,0.396508,0.925345,0.805237,0.473066,0.137157,0.887667,0.919147,0.490736,...,0.888894,0.497967,0.915676,0.458148,0.052033,0.762133,0.146822,0.508179,0.61683,0.744366
4,0.97284,0.703049,0.485899,0.195163,0.841767,0.275172,0.974552,0.22255,0.219953,0.606748,...,0.842807,0.286018,0.931792,0.160724,0.272184,0.125261,0.535565,0.278689,0.207621,0.57266
5,0.120565,0.793777,0.118731,0.480371,0.618002,0.722275,0.149801,0.20294,0.962033,0.390634,...,0.459538,0.396332,0.606321,0.262221,0.52365,0.371775,0.770666,0.207377,0.757789,0.266814

In [32]:
new_df.head()

          0         1         2         3         4         5
0       0.5  0.050022  0.837252  0.374849  0.972840  0.120565
1  0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
2  0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
3  0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
4  0.990029  0.922096  0.144762  0.805237  0.841767  0.618002

In [33]:
new_df.sort_index(axis=0, ascending=False)

            0         1         2         3         4         5
444  0.429324  0.755577  0.574693  0.744366  0.572660  0.266814
443  0.817977  0.630820  0.980287  0.616830  0.207621  0.757789
442  0.851114  0.993301  0.061036  0.508179  0.278689  0.207377
441  0.939527  0.011641  0.039981  0.146822  0.535565  0.770666
440  0.884037  0.597886  0.544405  0.762133  0.125261  0.371775
..        ...       ...       ...       ...       ...       ...
4    0.990029  0.922096  0.144762  0.805237  0.841767  0.618002
3    0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
2    0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
1    0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
0         0.5  0.050022  0.837252  0.374849  0.972840  0.120565

[445 rows x 6 columns]

In [34]:
new_df.sort_index(axis=1, ascending=True)

            0         1         2         3         4         5
0         0.5  0.050022  0.837252  0.374849  0.972840  0.120565
1    0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
2    0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
3    0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
4    0.990029  0.922096  0.144762  0.805237  0.841767  0.618002
..        ...       ...       ...       ...       ...       ...
440  0.884037  0.597886  0.544405  0.762133  0.125261  0.371775
441  0.939527  0.011641  0.039981  0.146822  0.535565  0.770666
442  0.851114  0.993301  0.061036  0.508179  0.278689  0.207377
443  0.817977  0.630820  0.980287  0.616830  0.207621  0.757789
444  0.429324  0.755577  0.574693  0.744366  0.572660  0.266814

[445 rows x 6 columns]

In [35]:
type(new_df[0])

pandas.core.series.Series

In [36]:
new_df2 = new_df.copy()

In [37]:
new_df2[0][0] = 983
new_df2.head()

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_8252/250112503.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df2[0][0] = 983

          0         1         2         3         4         5
0       983  0.050022  0.837252  0.374849  0.972840  0.120565
1  0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
2  0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
3  0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
4  0.990029  0.922096  0.144762  0.805237  0.841767  0.618002

In [38]:
new_df.head()

          0         1         2         3         4         5
0       0.5  0.050022  0.837252  0.374849  0.972840  0.120565
1  0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
2  0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
3  0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
4  0.990029  0.922096  0.144762  0.805237  0.841767  0.618002

In [48]:
new_df.loc[0, "A"] = 556  #no warning

In [49]:
new_df.head(2)

          A         B         C         D         E         F
0       556  0.050022  0.837252  0.374849  0.972840  0.120565
1  0.500473  0.685561  0.154368  0.516212  0.703049  0.793777

In [50]:
new_df.columns = list("ABCDEF")

In [47]:
new_df

            A         B         C         D         E         F
0         556  0.050022  0.837252  0.374849  0.972840  0.120565
1    0.500473  0.685561  0.154368  0.516212  0.703049  0.793777
2    0.680977  0.699380  0.821352  0.396508  0.485899  0.118731
3    0.748453  0.791702  0.748612  0.925345  0.195163  0.480371
4    0.990029  0.922096  0.144762  0.805237  0.841767  0.618002
..        ...       ...       ...       ...       ...       ...
440  0.884037  0.597886  0.544405  0.762133  0.125261  0.371775
441  0.939527  0.011641  0.039981  0.146822  0.535565  0.770666
442  0.851114  0.993301  0.061036  0.508179  0.278689  0.207377
443  0.817977  0.630820  0.980287  0.616830  0.207621  0.757789
444  0.429324  0.755577  0.574693  0.744366  0.572660  0.266814

[445 rows x 6 columns]

In [52]:
new_df = new_df.drop("F", axis=1)

In [53]:
new_df.head()

          A         B         C         D         E
0       556  0.050022  0.837252  0.374849  0.972840
1  0.500473  0.685561  0.154368  0.516212  0.703049
2  0.680977  0.699380  0.821352  0.396508  0.485899
3  0.748453  0.791702  0.748612  0.925345  0.195163
4  0.990029  0.922096  0.144762  0.805237  0.841767

In [60]:
new_df.loc[[1, 2], ["C", "D"]]
new_df.loc[[1, 2], :]
new_df.loc[:, ["C", "D"]]

            C         D
0    0.837252  0.374849
1    0.154368  0.516212
2    0.821352  0.396508
3    0.748612  0.925345
4    0.144762  0.805237
..        ...       ...
440  0.544405  0.762133
441  0.039981  0.146822
442  0.061036  0.508179
443  0.980287  0.616830
444  0.574693  0.744366

[445 rows x 2 columns]

# Try to Run Complex quearies in data frames

In [64]:
new_df.loc[new_df["A"] < 0.2]
new_df.loc[(new_df["B"] < 0.3) & (new_df["C"] > 0.1)]

            A         B         C         D         E
0         556  0.050022  0.837252  0.374849  0.972840
6    0.144695  0.118365  0.342959  0.137157  0.974552
7    0.036678  0.167078  0.116106  0.887667  0.222550
9    0.277083  0.057030  0.829709  0.490736  0.606748
12   0.521675  0.016284  0.470117  0.070624  0.267936
..        ...       ...       ...       ...       ...
427   0.52394  0.199547  0.114567  0.790869  0.610844
429  0.365341  0.087733  0.432069  0.408093  0.032383
436    0.2626  0.233281  0.394789  0.497967  0.286018
438  0.428054  0.216383  0.802912  0.458148  0.160724
439    0.6021  0.242117  0.910003  0.052033  0.272184

[121 rows x 5 columns]

In [65]:
new_df.loc[new_df["E"] > 0.9]

            A         B         C         D         E
0         556  0.050022  0.837252  0.374849  0.972840
6    0.144695  0.118365  0.342959  0.137157  0.974552
17   0.625676  0.563177  0.965214  0.136391  0.931545
29   0.052496  0.940768  0.273279  0.292614  0.963764
35   0.131842  0.336229  0.753875  0.196886  0.998477
47   0.553538  0.152603  0.220612  0.008444  0.910155
50   0.941991  0.559024  0.901597  0.639128  0.936206
65   0.728406  0.451994  0.734151  0.654081  0.948659
71    0.45968  0.793902  0.499120  0.988928  0.967478
72   0.653913  0.257968  0.645658  0.571425  0.989930
88   0.059318  0.554940  0.796272  0.209672  0.983149
90   0.612231  0.209893  0.548225  0.403316  0.911380
92   0.551908  0.979567  0.535845  0.033223  0.964862
95   0.261712  0.998895  0.098396  0.370226  0.922607
101  0.698204  0.593253  0.171341  0.246150  0.907596
135  0.203055  0.383980  0.200529  0.235306  0.917748
138  0.270762  0.346747  0.273166  0.851620  0.914685
151  0.290726  0.697051  0.800420  0.665286  0.930117
172  0.764501  0.283305  0.405959  0.828665  0.943905
179  0.882495  0.043571  0.576257  0.915535  0.989903
185  0.695887  0.382946  0.471972  0.162360  0.907523
189  0.196684  0.781696  0.153212  0.823799  0.939969
191  0.677567  0.372189  0.720290  0.072301  0.921400
223  0.793791  0.217459  0.193420  0.388971  0.960669
241  0.373259  0.160115  0.680648  0.196625  0.913394
260  0.885181  0.982262  0.443197  0.208619  0.976294
285  0.109656  0.796206  0.803851  0.713224  0.914616
306  0.383173  0.124955  0.033621  0.249980  0.912299
346  0.444359  0.321016  0.024932  0.992163  0.991067
374   0.61149  0.166950  0.633622  0.471283  0.964576
376  0.926825  0.209440  0.475075  0.276001  0.902137
394  0.002606  0.678595  0.594890  0.070798  0.901602
411   0.59772  0.093579  0.791200  0.639001  0.907138
437  0.705288  0.380009  0.602140  0.915676  0.931792

In [67]:
new_df.loc[:]

            A         B         C         D         E
0         556  0.050022  0.837252  0.374849  0.972840
1    0.500473  0.685561  0.154368  0.516212  0.703049
2    0.680977  0.699380  0.821352  0.396508  0.485899
3    0.748453  0.791702  0.748612  0.925345  0.195163
4    0.990029  0.922096  0.144762  0.805237  0.841767
..        ...       ...       ...       ...       ...
440  0.884037  0.597886  0.544405  0.762133  0.125261
441  0.939527  0.011641  0.039981  0.146822  0.535565
442  0.851114  0.993301  0.061036  0.508179  0.278689
443  0.817977  0.630820  0.980287  0.616830  0.207621
444  0.429324  0.755577  0.574693  0.744366  0.572660

[445 rows x 5 columns]

In [92]:
new_df.loc[10, "A"] = 108
new_df.dtypes

A     object
B    float64
C    float64
D    float64
E    float64
dtype: object